#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/e54b29e4-0cb4-4748-8ba5-53a081c1e5d6/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "another-prod-project-98jp"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "central-gcp-vpc-non-prod-37070"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "my-new-project-trw0"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "net-shared-vpc-prod-a72t"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-id"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "prod-project-369617"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["prod-project"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {
      + host_project    = "net-shared-vpc-prod-a72t"
      + id              = (known after apply)
      + service_project = "prod-project-369617"
    }

  # module.project-factory["prod-project"].module.project-factory.google_project_iam_member.controlling_group_vpc_membership[0] will be created
  + resource "google_project_iam_member" "controlling_group_vpc_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"
      + project = "net-shared-vpc-prod-a72t"
      + role    = "roles/compute.networkUser"
    }

  # module.project-factory["prod-project"].module.project-factory.google_project_iam_member.controlling_group_vpc_membership[1] will be created
  + resource "google_project_iam_member" "controlling_group_vpc_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"
      + project = "net-shared-vpc-prod-a72t"
      + role    = "roles/compute.networkUser"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["another-prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "another-prod-project-98jp"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["central-gcp-vpc-non-prod-37070"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "central-gcp-vpc-non-prod-37070"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["my-new-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "my-new-project-trw0"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["net-shared-vpc-prod"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "net-shared-vpc-prod-a72t"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-id"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["prod-project"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "prod-project-369617"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["prod-project"].module.project-factory.google_compute_shared_vpc_service_project.shared_vpc_attachment[0] will be created%0A  + resource "google_compute_shared_vpc_service_project" "shared_vpc_attachment" {%0A      + host_project    = "net-shared-vpc-prod-a72t"%0A      + id              = (known after apply)%0A      + service_project = "prod-project-369617"%0A    }%0A%0A  # module.project-factory["prod-project"].module.project-factory.google_project_iam_member.controlling_group_vpc_membership[0] will be created%0A  + resource "google_project_iam_member" "controlling_group_vpc_membership" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"%0A      + project = "net-shared-vpc-prod-a72t"%0A      + role    = "roles/compute.networkUser"%0A    }%0A%0A  # module.project-factory["prod-project"].module.project-factory.google_project_iam_member.controlling_group_vpc_membership[1] will be created%0A  + resource "google_project_iam_member" "controlling_group_vpc_membership" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = "serviceAccount:638944924927@cloudservices.gserviceaccount.com"%0A      + project = "net-shared-vpc-prod-a72t"%0A      + role    = "roles/compute.networkUser"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @token-generator-pull-request[bot], Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*